josuegarciajuan/cerraduras/docs/esp32-qr-reader/scanner-relay-prod-12v-robusto-lowpower.ino
  // Provisioning robusto: si no se pudo conectar a la red guardada (o no hay
  // credenciales), SIEMPRE abrimos el portal. La placa nunca debe quedarse en
  // un estado invisible ("credenciales que no conectan → sin AP y sin red").
  // Con timeout de 5 min el portal reinicia y reintenta la red guardada; si
  // vuelve a fallar, portal de nuevo → siempre recuperable desde el AP.
  if (!nvsConnected) {
    startWiFiManager();
  }

  // ── USB Host callbacks ──────────────────────────────────────────────
  usb.setKeyboardLayout(ESP_USB_HOST_KEYBOARD_LAYOUT_EN_US);

  usb.onDeviceConnected([](const EspUsbHostDeviceInfo &device) {
    Serial.print("\n══════════════════════════════════════════\n");
    Serial.print("[USB] DISPOSITIVO CONECTADO:\n");
    espUsbHostPrint(device);
    Serial.print("[USB] Listo. Escanea un QR...\n");
    Serial.print("══════════════════════════════════════════\n\n");
    scannerConnected = true;   // F33: track USB HID scanner presence
    scannerBeatPending = true; // F33: el heartbeat lo envía loop() (no la tarea USB)
  });

  usb.onDeviceDisconnected([](const EspUsbHostDeviceInfo &device) {
    Serial.print("\n[USB] desconectado: ");
    espUsbHostPrint(device);
    scannerConnected = false;  // F33: USB scanner disconnected
  });

  usb.onKeyboard([](const EspUsbHostKeyboardEvent &event) {
    if (!event.pressed) return;
    if (event.ascii == '\r' || event.ascii == '\n') {
      if (scanned.length() > 0) {
        // ── v5-dbg: diagnóstico completo ANTES de filtrar ──────────
        // Trim whitespace que el scanner GM65 pueda añadir (CR, LF, espacios)
        scanned.trim();

        int dots = 0;
        for (unsigned int i = 0; i < scanned.length(); i++) {
          if (scanned[i] == '.') dots++;
        }

        // ── VOLCADO COMPLETO del texto escaneado ─────────────────
        Serial.println("\n══════════════════════════════════════════");
        Serial.printf("[QR-SCAN] len=%d  dots=%d\n", scanned.length(), dots);
        Serial.printf("[QR-SCAN] TEXTO: %s\n", scanned.c_str());

        // Hex dump: primeros 60 bytes (3 filas de 20) para detectar
        // caracteres invisibles (BOM, STX, ETX, NUL, etc.)
        Serial.print("[QR-SCAN] HEX:   ");
        int dumpLen = scanned.length() < 60 ? scanned.length() : 60;
        for (int i = 0; i < dumpLen; i++) {
          Serial.printf("%02X ", (uint8_t)scanned[i]);
          if ((i + 1) % 20 == 0 && i + 1 < dumpLen)
            Serial.print("\n                 ");
        }
        if (scanned.length() > 60) {
          Serial.print("... (truncado, total ");
          Serial.print(scanned.length());
          Serial.print(" bytes)");
        }
        Serial.println();

        // Últimos 20 bytes (útil si el scanner añade sufijo)
        if (scanned.length() > 60) {
          Serial.print("[QR-SCAN] HEX tail: ");
          int tailStart = scanned.length() - 20;
          for (int i = tailStart; i < scanned.length(); i++) {
            Serial.printf("%02X ", (uint8_t)scanned[i]);
          }
          Serial.println();
        }
        Serial.println("══════════════════════════════════════════");

        // ── Validación de formato ────────────────────────────────
        // Requisitos: exactamente 2 puntos (token JWT-like) y >= 100 chars
        if (dots != 2 || scanned.length() < 100) {
          Serial.printf("[QR] RECHAZADO — dots=%d (necesita 2), len=%d (necesita >=100)\n",
                        dots, scanned.length());
          if (scanned.length() < 100)
            Serial.println("[QR]   → posible lectura parcial o token truncado");
          if (dots > 2)
            Serial.println("[QR]   → scanner añade puntos extra (prefijo/sufijo?)");
          if (dots < 2)
            Serial.println("[QR]   → faltan puntos — token malformado o scanner omite '.'");
          // Sin relayClick(): el feedback acústico pulsaba el relé (y con la
          // cerradura conectada disparaba el solenoide) en cada lectura
          // rechazada. En producto el relé solo se acciona por apertura real.
          scanned = "";
          return;
        }

        // ── Formato OK → encolar para POST a la API ──────────────
        Serial.println("[QR] Formato OK → encolando para validación API");
        pendingQr  = scanned;
        hasPending = true;
        scanned    = "";
      }
      return;
    }
    // Acumular solo caracteres imprimibles (excluir DEL 0x7F)
    if (event.ascii >= 0x20 && event.ascii != 0x7F) scanned += (char)event.ascii;
  });

  // LOW-POWER: el registro de callbacks de arriba no consume; el arranque real
  // del host (usb.begin) se difiere al FINAL de setup() para que el inrush del
  // lector no coincida con el pico de WiFi/NTP/health. No poner usb.begin() aquí.


  // ── Sincronizar reloj antes de cualquier HTTPS (crítico para TLS) ──
  if (ensureWiFi()) {
    syncSystemTime();
  }

  // ── Health check + blink (solo en WiFi NUEVA) ──────────────────────
  if (ensureWiFi()) {
    HTTPClient h;
    beginApiRequest(h, String(API_BASE_URL) + "/api/v1/health");
    h.setTimeout(4000);
    int c = h.GET();
    String healthResp = h.getString();
    h.end();
    Serial.printf("[BOOT] API health: HTTP %d — %s\n", c, healthResp.c_str());

    // Solo parpadea el switch si la red WiFi es NUEVA (no reconexión a red conocida)
    Preferences prefs;
    prefs.begin("cerraduras", false);
    String currentSsid = WiFi.SSID();
    String lastSsid    = prefs.getString("last_ssid", "");
    prefs.end();

    // LOW-POWER: si venimos de brownout, no disparamos el blink-light (evita
    // una petición TLS con timeout de 15 s en pleno arranque marginal).
    if (currentSsid.length() > 0 && currentSsid != lastSsid && !bootFromBrownout) {
      Serial.printf("[BOOT] WiFi NUEVA: '%s' (anterior: '%s') → parpadeo\n",
                    currentSsid.c_str(),
                    lastSsid.length() ? lastSsid.c_str() : "ninguna");

      String blinkBody;
      blinkBody.reserve(120);  // Fase 1: pre-allocate
      blinkBody = "{\"external_id\":\"" + chipId() + "\"}";
      HTTPClient h2;
      beginApiRequest(h2, String(API_BASE_URL) + "/dashboard-api/blink-light");
      h2.addHeader("Content-Type", "application/json");
      addDeviceAuth(h2);
      h2.setTimeout(15000);
      int bc = h2.POST(blinkBody);
      String blinkResp = h2.getString();
      h2.end();
      Serial.printf("[BOOT] Blink light: HTTP %d — %s\n", bc, blinkResp.c_str());

      // Guardar nuevo SSID tras parpadeo para no repetir en próximos arranques
      prefs.begin("cerraduras", false);
      prefs.putString("last_ssid", currentSsid);
      prefs.end();
    } else {
      Serial.printf("[BOOT] WiFi conocida '%s' — sin parpadeo\n", currentSsid.c_str());
    }
  }

