josuegarciajuan/cerraduras/docs/esp32-qr-reader/scanner-relay-prod-12v-robusto-lowpower.ino
  // ── LOW-POWER: USB Host AL FINAL, con respiro antes de encenderlo ──
  // El host USB (lector GM65) produce un inrush; encenderlo tras asentar
  // WiFi/NTP/health evita sumar cargas en la ventana crítica del arranque.
  delay(bootFromBrownout ? USB_BOOT_DELAY_BROWNOUT_MS : USB_BOOT_DELAY_MS);
  if (!usb.begin()) {
    Serial.printf("usb.begin() fallo: %s\n", usb.lastErrorName());
  } else {
    Serial.println("[USB] Host iniciado correctamente");
  }
}

// ── loop ──────────────────────────────────────────────────────────────────
void loop() {
  // Fase 1: Watchdog — suscribir loopTask al TWDT recién en la 1ª iteración.
  // setup() corrió con TWDT global init a 60s pero sin loopTask suscrito, de modo
  // que el provisioning largo jamás quedó vigilado con timeout corto.
  static bool wdt_ready = false;
  if (!wdt_ready) {
    esp_task_wdt_add(NULL);
    wdt_ready = true;
  }
  esp_task_wdt_reset();  // Fase 1: feed the watchdog cada iteración

  // Procesar QR pendiente
  if (hasPending) {
    if (!ensureWiFi()) {
      static unsigned long lastWifiWarn = 0;
      if (millis() - lastWifiWarn > 5000) {
        Serial.println("[QR] Pendiente pero sin WiFi — esperando reconexión...");
        lastWifiWarn = millis();
      }
      hasPending = true;  // Fase 1: reencolar para siguiente iteración (no bloqueante)
      return;
    }

    hasPending = false;
    String qr = pendingQr;
    String id = chipId();

    Serial.printf("\n══════════════════════════════════════════\n");
    Serial.printf("[QR-POST] device_id=%s\n", id.c_str());
    Serial.printf("[QR-POST] QR len=%d\n", qr.length());
    Serial.printf("[QR-POST] WiFi RSSI=%d dBm\n", WiFi.RSSI());

    // ── Escape manual del QR text para JSON (solo " y \ son peligrosos) ──
    // Base64url no contiene " ni \, pero si el scanner introduce basura
    // por error de lectura, esto evita JSON inválido.
    String qrEscaped = qr;
    qrEscaped.replace("\\", "\\\\");
    qrEscaped.replace("\"", "\\\"");

    String body;
    body.reserve(600);  // Fase 1: pre-allocate for qr_text (~400 chars) + device_id + JSON
    body = "{\"qr_text\":\"" + qrEscaped + "\",\"device_id\":\"" + id + "\"}";

    Serial.printf("[QR-POST] Body JSON (%d bytes): %s\n", body.length(), body.c_str());
    Serial.printf("══════════════════════════════════════════\n");
    esp_task_wdt_reset();  // defensa: feed antes de HTTP bloqueante
    HTTPClient http;
    beginApiRequest(http, String(API_BASE_URL) + "/api/v1/qr/validate");
    http.addHeader("Content-Type", "application/json");
    addDeviceAuth(http);
    http.setTimeout(4000);

    unsigned long qrStart = millis();
    int code = http.POST(body);
    unsigned long qrElapsed = millis() - qrStart;
    String resp = http.getString();
    http.end();
    esp_task_wdt_reset();  // defensa: feed tras HTTP bloqueante
    yield();

    Serial.printf("[QR] Validación HTTP %d (%lu ms) → %s\n", code, qrElapsed, resp.c_str());

    if (code == 200) {
      Serial.println(">> ACCESO PERMITIDO — Abriendo relé...");
      relayPulse();
      // LOW-POWER: NO hacer el heartbeat LOCK aquí. Antes se lanzaba un POST TLS
      // con la bobina/solenoide aún energizada (OPEN_DURATION_MS) → pico WiFi TX
      // + inrush del solenoide a la vez. loop() lo enviará cuando el relé vuelva
      // a reposo (ver bloque "LOCK heartbeat diferido").
      lockHeartbeatPending = true;
    } else {
      Serial.println(">> ACCESO DENEGADO");
    }
  }

  // ── F33: heartbeat de SCANNER diferido ─────────────────────────────
  // El callback onDeviceConnected solo marca el flag; aquí, en la tarea
  // principal, se envía con el cliente TLS compartido (secuencial).
  // LOW-POWER: saltar si el relé está activo (no solapar TLS con la bobina).
  if (scannerBeatPending && !relayPulsing) {
    if (ensureWiFi()) {
      scannerBeatPending = false;
      esp_task_wdt_reset();  // feed antes de HTTP bloqueante
      HTTPClient hScan;
      beginApiRequest(hScan, String(API_BASE_URL) + "/dashboard-api/device-heartbeat");
      hScan.addHeader("Content-Type", "application/json");
      addDeviceAuth(hScan);
      hScan.setTimeout(3000);
      int sc = hScan.POST("{\"external_id\":\"" + chipId() + "\",\"sub_kind\":\"SCANNER\"}");
      String sr = hScan.getString();
      hScan.end();
      esp_task_wdt_reset();  // feed tras HTTP bloqueante
      Serial.printf("[USB] SCANNER heartbeat → HTTP %d %s\n", sc, sr.c_str());
    } else {
      static unsigned long lastScannerWarn = 0;
      if (millis() - lastScannerWarn > 5000) {
        Serial.println("[USB] SCANNER pendiente de heartbeat pero sin WiFi — reintentando...");
        lastScannerWarn = millis();
      }
    }
  }

  // Heartbeat cada 30s + F33 command-check
  // LOW-POWER: si el relé está activo, NO se envía nada por red en esta vuelta;
  // se pospone (lastBeat no se actualiza) hasta que la bobina vuelva a reposo.
  unsigned long now = millis();
  if (now - lastBeat > 30000 && !relayPulsing) {
    lastBeat = now;

    // ── Fase 1: Heap monitor ──
    unsigned long heap = ESP.getFreeHeap();
    Serial.printf("[HB] Free heap: %lu bytes\n", heap);
    if (heap < 20480) {
      Serial.printf("[HB] ⚠️ ADVERTENCIA: heap bajo (%lu bytes) — posible fuga de memoria\n", heap);
    }

    if (ensureWiFi()) {
      esp_task_wdt_reset();  // defensa: feed antes de cadena HTTP bloqueante
      HTTPClient h;
      beginApiRequest(h, String(API_BASE_URL) + "/api/v1/health");
      h.setTimeout(4000);
      int hc = h.GET();
      String hr = h.getString();
      h.end();
      esp_task_wdt_reset();  // defensa: feed entre HTTP
      yield();
      Serial.printf("[HB] Health check: HTTP %d — %s\n", hc, hr.c_str());

      delay(HTTP_GAP_MS);  // LOW-POWER: respiro de rail entre peticiones TLS

      // F33: send heartbeat with batch sub_kinds for all ESP32 sub-devices
      String hbBody;
      hbBody.reserve(250);  // Fase 1: pre-allocate
      hbBody = "{\"external_id\":\"" + chipId() + "\",\"sub_kinds\":[\"RPI\",\"SCANNER\",\"LOCK\"]}";
      HTTPClient hb;
      beginApiRequest(hb, String(API_BASE_URL) + "/dashboard-api/device-heartbeat");
      hb.addHeader("Content-Type", "application/json");
      addDeviceAuth(hb);
      hb.setTimeout(3000);
      int hbCode = hb.POST(hbBody);
      String hbResp = hb.getString();
      hb.end();
      esp_task_wdt_reset();  // defensa: feed entre HTTP
      yield();
      Serial.printf("[HB] Heartbeat [HTTP %d] %s\n", hbCode, hbResp.c_str());

      // F33: If API reports pending commands, poll and execute them
      if (hbCode == 200 && hbResp.indexOf("\"has_pending_commands\":true") > 0) {
        Serial.println("[F33] Polling pending commands...");
        esp_task_wdt_reset();  // defensa: feed antes de HTTP bloqueante
        delay(HTTP_GAP_MS);    // LOW-POWER: respiro de rail antes del poll
        HTTPClient cmdPoll;
        beginApiRequest(cmdPoll, String(API_BASE_URL) + "/dashboard-api/pending-command?external_id=" + chipId());
        cmdPoll.setTimeout(3000);
        addDeviceAuth(cmdPoll);
        int cmdCode = cmdPoll.GET();
        String cmdResp = cmdPoll.getString();
        cmdPoll.end();
        esp_task_wdt_reset();  // defensa: feed tras HTTP bloqueante
        yield();
        Serial.printf("[F33] Poll → HTTP %d %s\n", cmdCode, cmdResp.c_str());

        if (cmdCode == 200) {
          // Simple JSON parse to find command_id and command type
          // (no ArduinoJSON — string search is lightweight enough for this)
          int cmdIdStart = cmdResp.indexOf("\"id\":");
          // El nombre del comando viene en el campo de nivel superior
          // "command_name":"..." (único, no anidado) que la API siempre
          // incluye junto al comando. Buscar "command": rompe porque también
          // aparece dentro del objeto anidado "command":{...,"command":...}.
          int cmdNameStart = cmdResp.indexOf("\"command_name\":");
          if (cmdIdStart >= 0 && cmdNameStart >= 0) {
            // Extract command id
            int cmdIdValStart = cmdResp.indexOf(":", cmdIdStart) + 1;
            int cmdIdEnd = cmdResp.indexOf(",", cmdIdValStart);
            if (cmdIdEnd < 0) cmdIdEnd = cmdResp.indexOf("}", cmdIdValStart);
            String cmdIdStr = cmdResp.substring(cmdIdValStart, cmdIdEnd);
            cmdIdStr.trim();
            int cmdId = cmdIdStr.toInt();

            // Extract command name from the top-level "command_name":"..." field
            // "command_name": = 15 chars + comilla de apertura = valor en +16
            int cmdValStart = cmdNameStart + 16;                 // saltar "command_name":"
            int cmdValEnd = cmdResp.indexOf("\"", cmdValStart);  // comilla de cierre
            String cmdName = (cmdValEnd > cmdValStart) ? cmdResp.substring(cmdValStart, cmdValEnd) : String("");

            Serial.printf("[F33] Executing command #%d: %s\n", cmdId, cmdName.c_str());

            if (cmdName == "check") {
              // Verify SCANNER: USB HID keyboard connected?
              bool scannerOk = scannerConnected;

              // Verify LOCK: 5ms relay pulse test
              bool lockOk = checkLock();

              // RPI is always online if we're executing this
              Serial.printf("[F33] SCANNER=%s LOCK=%s RPI=true\n",
                            scannerOk ? "ok" : "offline", lockOk ? "ok" : "offline");

