josuegarciajuan/cerraduras/docs/esp32-qr-reader/scanner-relay-prod-12v-robusto-lowpower.ino
              // Report results
              String resultBody;
              resultBody.reserve(350);  // Fase 1: pre-allocate
              resultBody = "{\"command_id\":" + String(cmdId) +
                                   ",\"external_id\":\"" + chipId() + "\"" +
                                   ",\"results\":{" +
                                   "\"RPI\":true," +
                                   "\"SCANNER\":" + String(scannerOk ? "true" : "false") + "," +
                                   "\"LOCK\":" + String(lockOk ? "true" : "false") +
                                   "}}";

              HTTPClient cmdResult;
              beginApiRequest(cmdResult, String(API_BASE_URL) + "/dashboard-api/command-result");
              cmdResult.addHeader("Content-Type", "application/json");
              addDeviceAuth(cmdResult);
              cmdResult.setTimeout(3000);
              int resCode = cmdResult.POST(resultBody);
              String resResp = cmdResult.getString();
              cmdResult.end();
              esp_task_wdt_reset();  // defensa: feed tras HTTP bloqueante
              yield();
              Serial.printf("[F33] Command result POST → HTTP %d %s\n", resCode, resResp.c_str());
            } else {
              Serial.printf("[F33] Unknown command: %s — skipping\n", cmdName.c_str());
            }
          } else {
            Serial.println("[F33] No command data in response");
          }
        } else {
          Serial.printf("[F33] Poll failed (HTTP %d)\n", cmdCode);
        }
      }
    }
  }

  // ── Identify button ─────────────────────────────────────────────────
  bool raw = digitalRead(IDENTIFY_PIN);
  if (raw != lastIdentifyState) {
    if (now - identifyDebounce > IDENTIFY_DEBOUNCE_MS) {
      lastIdentifyState = raw;
      identifyPending   = true;
      pendingState      = (raw == LOW);
      Serial.printf("\n[IDENTIFY] flanco → state=%s\n", pendingState ? "true (pulsado)" : "false (suelto)");
    }
    identifyDebounce = now;
  }

  if (lastIdentifyState == LOW && now - lastIdentifyPrint > 500) {
    lastIdentifyPrint = now;
    Serial.printf("[IDENTIFY] PULSANDO... (%s)\n", chipId().c_str());
  }

  if (identifyPending) {
    identifyPending = false;
    sendIdentify(pendingState);
  }

  // ── Fase 1: Relé no bloqueante ──
  if (relayPulsing && millis() > relayOffAt) {
    relayOff();
    relayPulsing = false;
    Serial.println("[RELAY] → OFF (pestillo cerrado)");
  }

  // ── LOW-POWER: LOCK heartbeat diferido ──
  // Se envía SOLO con el relé ya en reposo, para que el pico de WiFi TX no
  // coincida con la bobina/solenoide energizada.
  if (lockHeartbeatPending && !relayPulsing) {
    lockHeartbeatPending = false;
    if (ensureWiFi()) {
      esp_task_wdt_reset();
      delay(HTTP_GAP_MS);  // respiro de rail antes de la petición TLS
      HTTPClient hLock;
      beginApiRequest(hLock, String(API_BASE_URL) + "/dashboard-api/device-heartbeat");
      hLock.addHeader("Content-Type", "application/json");
      addDeviceAuth(hLock);
      hLock.setTimeout(3000);
      int lc = hLock.POST("{\"external_id\":\"" + chipId() + "\",\"sub_kind\":\"LOCK\"}");
      String lr = hLock.getString();
      hLock.end();
      esp_task_wdt_reset();
      yield();
      Serial.printf("[QR] LOCK heartbeat (diferido) → HTTP %d %s\n", lc, lr.c_str());
    } else {
      lockHeartbeatPending = true;  // reintentar cuando haya WiFi
    }
  }

  // ── Fase 1: LED feedback no bloqueante ──
  if (ledOffAt && millis() > ledOffAt) {
    digitalWrite(LED_PIN, LOW);
    ledOffAt = 0;
    Serial.println("[OK] LED apagado");
  }

  // ── LOW-POWER: WiFi watchdog SIN reinicio ──
  // Antes: ESP.restart() a los 120 s. En una placa marginal cada arranque es un
  // pico de inrush + asociación WiFi que realimenta el brownout (bucle). Ahora se
  // reintenta la conexión; si la red vuelve, la placa se recupera sin reiniciar.
  if (WiFi.status() != WL_CONNECTED) {
    if (wifiDownSince == 0) {
      wifiDownSince = millis();
      Serial.println("[WIFI] Conexión perdida — reintentando sin ESP.restart");
    } else if (millis() - wifiDownSince > WIFI_RETRY_MS) {
      wifiDownSince = millis();
      Serial.println("[WIFI] Reintento de conexión (sin reinicio)");
      WiFi.disconnect();
      delay(200);
      WiFi.reconnect();
    }
  } else {
    wifiDownSince = 0;
  }

  // ── Fase 39: inventario auxiliar, después de QR/USB/heartbeat/identify ──
  // HTTPClient usa el timeout corto mínimo disponible; no hay delay ni bucle de espera.
  // LOW-POWER: no anunciar con el relé activo; y dejar respiro de rail SOLO cuando
  // el announce realmente va a emitir (no delay por vuelta, para no ralentizar loop).
  esp_task_wdt_reset();  // defensa: feed antes del posible HTTP de announce
  if (!relayPulsing) {
    bool announceDue = factoryAnnouncementEnabled && !factoryAnnouncementInFlight &&
                       (now >= factoryNextAttemptAt) && (WiFi.status() == WL_CONNECTED);
    if (announceDue) {
      delay(HTTP_GAP_MS);
    }
    announceFactoryDevice(now);
  }
  esp_task_wdt_reset();  // defensa: feed tras el posible HTTP de announce
  yield();
}
